app/views/order_details/index.html.erb

      <tr>
      <td><%= order_detail.order_user.order.restaurant %></td>
       <td><%= link_to order_detail.order_user.user.email, user_path(order_detail.order_user.user.id) %></td>
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]

        <td><%= order_detail.comment %></td>
        <% if order_detail.order_user.user.id == current_user.try(:id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]