app/views/group_members/index.html.erb

      <tr>
        <td><%= group_member.group.name %></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]