app/views/groups/index.html.erb


  <% current_user.try(:groups).each do |group| %>
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 10]]