app/views/orders/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]
---
      <tr>
      <td><%= order.order.user.email %></td>
        <td><%= order.order.restaurant %></td>
        <td><%= order.order.status %></td>
        <td><%= order.status %></td>
        <% if order.status != "joined" && order.order.status != "finished" %>