app/views/orders/show.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
      <tr>
        <td><%= order_user.order.restaurant %></td>