app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        @article.user = current_user

        if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "Article1"], ["text", "lksd"], ["created_at", "2019-04-10 12:23:54.953318"], ["updated_at", "2019-04-10 12:23:54.953318"], ["user_id", 10]]