app/controllers/friendships_controller.rb

    def create
        @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
        if @friendship.save
---
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 15], ["friend_id", 10], ["created_at", "2019-04-11 16:23:46.298988"], ["updated_at", "2019-04-11 16:23:46.298988"]]

  def destroy
      @friendship = current_user.friendships.find(params[:id])
      @groups = current_user.groups
      for group in @groups
        if group.users.include? @friendship.friend
            @x= group.users.select('id').find(@friendship.friend.id)
            group.group_members.where('user_id = (?)',@x).destroy_all
        end
      end
      @friendship.destroy
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."id" = ? LIMIT ?  [["user_id", 10], ["id", 36], ["LIMIT", 1]]
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 10]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."id" = ? LIMIT ?  [["user_id", 16], ["id", 19], ["LIMIT", 1]]
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = ? AND "friendships"."id" = ? LIMIT ?  [["user_id", 17], ["id", 29], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" INNER JOIN "group_members" ON "users"."id" = "group_members"."user_id" WHERE "group_members"."group_id" = ? AND "users"."id" = ? LIMIT ?  [["group_id", 21], ["id", 10], ["LIMIT", 1]]
DELETE FROM "group_members" WHERE "group_members"."id" = ?  [["id", 9]]
SELECT "group_members".* FROM "group_members" WHERE "group_members"."group_id" = ? AND (user_id = (15))  [["group_id", 21]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 29]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 45]]