app/controllers/friendships_controller.rb

SELECT "users".* FROM "users" WHERE (id NOT IN (SELECT "friendships"."friend_id" FROM "friendships" WHERE "friendships"."user_id" = 17) AND id != (17))
---
    def index
        @users = User.all