app/controllers/groups_controller.rb

  def index
    @groups = current_user.groups
---
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 10]]