app/controllers/group_members_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]
INSERT INTO "group_members" ("group_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["group_id", 21], ["user_id", 15], ["created_at", "2019-04-15 05:23:49.699421"], ["updated_at", "2019-04-15 05:23:49.699421"]]
---
  def create
    @group = Group.find(params[:group_id])
    @group_member = @group.group_members.build(:user_id => params[:user_id])
    respond_to do |format|
      if @group_member.save

DELETE FROM "group_members" WHERE "group_members"."id" = ?  [["id", 1]]
---
  def destroy
    @group_member.destroy

SELECT  "group_members".* FROM "group_members" WHERE "group_members"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_group_member
      @group_member = GroupMember.find(params[:id])