app/controllers/groups_controller.rb

  def create

    @user = User.find(params[:user_id])
    @group = @user.groups.create(group_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
INSERT INTO "groups" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Cloud"], ["user_id", 10], ["created_at", "2019-04-10 15:02:43.703076"], ["updated_at", "2019-04-10 15:02:43.703076"]]

  def update
    respond_to do |format|
      if @group.update(group_params)
---
UPDATE "groups" SET "name" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["name", "mayar2"], ["updated_at", "2019-04-15 04:48:10.651132"], ["id", 19]]

    def set_group
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]