app/controllers/order_details_controller.rb

SELECT "order_details".* FROM "order_details"
---
  def index
    @order_details = OrderDetail.all