app/controllers/orders_controller.rb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "order_users"."id" FROM "order_users" WHERE (order_id NOT IN = (SELECT "orders"."id" FROM "orders"))
---
  def index
    @orders = Order.where('user_id = (?)',current_user.try(:id))
    @involvedOrders = OrderUser.where('user_id = (?)',current_user.try(:id))

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT "order_users".* FROM "order_users" WHERE "order_users"."order_id" = ?  [["order_id", 17]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
---
  def show
    @order = Order.find(params[:id])
    @order_users = @order.order_users

INSERT INTO "order_users" ("order_id", "user_id", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["order_id", 20], ["user_id", 10], ["status", 1], ["created_at", "2019-04-16 18:12:19.139241"], ["updated_at", "2019-04-16 18:12:19.139241"]]
INSERT INTO "orders" ("restaurant", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["restaurant", "kfc"], ["user_id", 17], ["created_at", "2019-04-11 16:13:54.433202"], ["updated_at", "2019-04-11 16:13:54.433202"]]
---
  def create
    @order = current_user.orders.build(order_params)
    @orderUser = @order.order_users.build(:user_id => current_user.try(:id) , :status => 1)
    respond_to do |format|
      if @order.save && @orderUser.save

UPDATE "orders" SET "restaurant" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["restaurant", "mac"], ["updated_at", "2019-04-11 15:50:46.320196"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @order.update(order_params)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "orders" SET "status" = ?, "updated_at" = ? WHERE "orders"."id" = ?  [["status", 1], ["updated_at", "2019-04-14 19:19:20.778571"], ["id", 13]]
---
  def finish
    @order = Order.find(params[:id])
    @order.update(status: 1)

DELETE FROM "order_users" WHERE "order_users"."id" = ?  [["id", 10]]
SELECT "order_users"."id" FROM "order_users" WHERE (order_id NOT IN = (SELECT "orders"."id" FROM "orders"))
---
    def delete_records
      @order=OrderUser.select("id").where('order_id NOT IN (?)',Order.select("id").all).destroy_all