app/controllers/order_users_controller.rb

  def index
    @order_users =OrderUser.where('order_id = (?)',params[:order_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 15], ["LIMIT", 1]]
SELECT "order_users".* FROM "order_users" WHERE (user_id = (NULL))

  def show
    @order_users =OrderUser.where('order_id = (?) and user_id = (?)',params[:order_id],params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]

  def new
    @users = User.where('id IN (?) AND id NOT IN (?)',Friendship.select("friend_id").where(user_id: current_user.try(:id)),OrderUser.select("user_id").where('order_id = (?)',params[:order_id]))
    @order_users = Order.find(params[:order_id]).users
    @groups = current_user.groups.to_a
---
SELECT "users".* FROM "users" INNER JOIN "order_users" ON "users"."id" = "order_users"."user_id" WHERE "order_users"."order_id" = ?  [["order_id", 16]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT "friendships".* FROM "friendships" WHERE (user_id = (15))
SELECT "users".* FROM "users" WHERE (id IN (SELECT "friendships"."friend_id" FROM "friendships" WHERE "friendships"."user_id" = 17) AND id NOT IN (SELECT "order_users"."user_id" FROM "order_users" WHERE (order_id = ('7'))))
SELECT "groups".* FROM "groups" WHERE "groups"."user_id" = ?  [["user_id", 10]]

  def create
    @order = Order.find( params[:order_id])
    @orderUser = @order.order_users.build(:user_id => params[:user_id])
    if @orderUser.save
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "order_users" ("order_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["order_id", 10], ["user_id", 10], ["created_at", "2019-04-16 18:15:30.049535"], ["updated_at", "2019-04-16 18:15:30.049535"]]

  def update
    respond_to do |format|
      if @order_user.update(order_user_params)
---
UPDATE "order_users" SET "status" = ?, "updated_at" = ? WHERE "order_users"."id" = ?  [["status", 1], ["updated_at", "2019-04-15 13:53:41.312089"], ["id", 9]]

  def join
    @order = OrderUser.where('order_id = (?) and user_id = (?) ',params[:id],params[:user])
    @order.update(status: 1)
---
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "order_users" SET "status" = ?, "updated_at" = ? WHERE "order_users"."id" = ?  [["status", 1], ["updated_at", "2019-04-16 19:07:19.766910"], ["id", 21]]

  def addGroup
    @groupMembers = Group.find(params[:group_id]).users
  @order = Order.find( params[:order_id])
  for groupMember in @groupMembers
    if @order.users.exclude? groupMember
      @orderUser = @order.order_users.build(:user_id => groupMember.id)
      @orderUser.save
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 25], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 16], ["LIMIT", 1]]
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "order_users" ("order_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["order_id", 16], ["user_id", 15], ["created_at", "2019-04-16 15:01:52.551285"], ["updated_at", "2019-04-16 15:01:52.551285"]]

  def destroy
    @order_user.destroy
---
DELETE FROM "order_users" WHERE "order_users"."id" = ?  [["id", 18]]

    def set_order_user
      @order_user = OrderUser.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 17], ["LIMIT", 1]]
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]