app/controllers/order_users_controller.rb

  def addGroup
    @groupMembers = GroupMember.where('group_id = (?)',params[:group_id])
---
SELECT  "group_members".* FROM "group_members" WHERE "group_members"."id" = ? LIMIT ?  [["id", 21], ["LIMIT", 1]]

  def destroy
    @order_user.destroy
---
DELETE FROM "order_users" WHERE "order_users"."id" = ?  [["id", 4]]