app/controllers/order_details_controller.rb

  def index
    @order_users = OrderUser.select('id').where('order_id = (?) ',params[:order_id])
    @order_details = OrderDetail.where('order_user_id IN (?) ',@order_users)
---
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "order_details".* FROM "order_details" WHERE (order_user_id IN (SELECT "order_users"."id" FROM "order_users" WHERE (order_id = ('15') )) )

  def new
    @order_info = OrderDetail.where('order_user_id = (?) ',params[:order_user_id]).count
    if @order_info == 0
       @order_detail = OrderDetail.new
    else
      @order_detail = OrderDetail.where('order_user_id = (?) ',params[:order_user_id])
      redirect_to edit_order_order_user_order_detail_path(params[:order_id],params[:order_user_id],@order_detail.ids)
---
SELECT COUNT(*) FROM "order_details" WHERE (order_user_id = ('order_user_id') )
SELECT "order_details"."id" FROM "order_details" WHERE (order_user_id = ('3') )

  def create
    @orderUser= OrderUser.find( params[:order_user_id])
    @order_detail = @orderUser.order_details.build(order_detail_params)

    respond_to do |format|
      if @order_detail.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT  "order_users".* FROM "order_users" WHERE "order_users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "order_details" ("order_user_id", "item", "amount", "price", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["order_user_id", 7], ["item", "sandwitch"], ["amount", 12], ["price", 80.0], ["comment", "too spicy"], ["created_at", "2019-04-15 03:29:29.655940"], ["updated_at", "2019-04-15 03:29:29.655940"]]

  def update
    respond_to do |format|
      if @order_detail.update(order_detail_params)
---
UPDATE "order_details" SET "comment" = ?, "updated_at" = ? WHERE "order_details"."id" = ?  [["comment", "spicy"], ["updated_at", "2019-04-15 03:08:20.699871"], ["id", 7]]

  def destroy
    @order_detail.destroy
---
DELETE FROM "order_details" WHERE "order_details"."id" = ?  [["id", 6]]

    def set_order_detail
      @order_detail = OrderDetail.find(params[:id])
---
SELECT  "order_details".* FROM "order_details" WHERE "order_details"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]