app/views/order_users/index.html.erb

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
---
      <tr>
        <td><%= order_user.order.restaurant %></td>